<?php

//Математические функции
$a = 10;
$b = 3;
echo nl2br(  $a . " mod " . $b . " = " . $a % $b . "\n");

if ($a % $b === 0)
    echo nl2br("a делится без остатка на b. Результат деления: " . $a / $b . "\n");
else
    echo nl2br("a делится на b с остатком = " . $a % $b . "\n\n");

//Работа со степенью и корнем
$st = 2 ** 10;
echo nl2br("2 в 10 степени: " . $st . "\n");
echo nl2br("квадратный корень из 245: " . sqrt(245) . "\n");

$r = array(4, 2, 5, 19, 13, 0, 10);
$sum = 0;
foreach ($r as $value){
    $sum += $value ** 2;
}
echo nl2br(" корень из суммы квадратов элементов массива: " . sqrt($sum) . "\n\n");

//Работа с функциями округления
$q = sqrt(379);
echo nl2br("округление до целых: " . round( $q ) . " , десятых: " . round($q ,1) . " , сотых: " . round($q ,2) . "\n");

$round = [
    'floor' => floor(sqrt(587)),
    'ceil' => ceil(sqrt(587))
];
echo nl2br("Округление корня из 587 
в большую сторону: " . $round['floor'] . "
в меньшую сторону: " . $round['ceil'] . "\n\n");

//Работа с min и max
$minmax = [4, -2, 5, 19, -130, 0, 10];
echo nl2br(" минимальное число = " . min($minmax) . "\n максимальное число = " . max($minmax) . "\n\n");

//Работа с рандомом
echo nl2br("случайное число от 1 до 100: " . rand(1 , 100) . "\n");

$rand = array();
echo "массив случайных чисел: ";
for ($i = 0; $i < 10; $i++){
    $rand[$i] = rand();
    echo $rand[$i] . " ";
}
echo nl2br("\n\n");

//Работа с модулем
$a = rand(1 , 100);
$b = rand(1 , 100);
echo nl2br("модуль разности " . $a . " и " . $b . " = " . abs($a - $b) . "\n");

$r = [1, 2, -1, -2, 3, -3];
echo "массив положительных чисел: ";
for ($i = 0; $i < sizeof($r); $i++){
    $r[$i] = abs($r[$i]);
    echo $r[$i] . " ";
}
echo nl2br("\n\n");

//Общее
$q = 30;
$r = [];
echo "Делители числа " . $q . " : ";
for ($i = 1; $i <= $q; $i++){
    if($q % $i ===0){
        $r[]=$i;
        echo $i . " ";
    }
}

$r = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
$sum = 0;
$i = 0;
while ($sum < 10){
    $sum += $r[$i];
    $i ++;
}
echo nl2br("\n" . $i . " первых элементов массива нужно сложить, чтобы сумма получилась больше 10");
